Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: To enforce that only one button can be checked at a time, set the app:singleSelection attribute to true on the MaterialButtonToggleGroup or call setSingleSelection(true).
zh_cn: 要强制一次只能选中一个按钮，请在 MaterialButtonToggleGroup 上将 app:singleSelection 属性设置为 true 或调用 setSingleSelection(true)。

source: To ensure that any existing drawables are restored correctly, you should set those compound drawables relatively (start/end), as opposed to absolutely (left/right).
zh_cn: 为了确保正确恢复任何现有的 drawable，你应该相对设置这些复合 drawable(开始/结束)，而不是绝对(左/右)。

source: To exactly match the IDE settings, the imports should be:
zh_cn: 要完全符合 IDE 设置，导入顺序应为：

source: To find elapsed time in Android Studio, you must disable filters in your logcat view.
zh_cn: 要在 Android Studio 中查找已用时间，必须在 logcat 视图中禁用过滤器。

source: To fix the issue, we issue endAnimation() here to make sure animation of this view finishes.
zh_cn: 为了解决这个问题，我们在这里发出 endAnimation() 以确保这个 view 的动画完成。

source: To force a view to draw, call invalidate().
zh_cn: 要强制绘制一个 view，调用 invalidate() 方法。

source: To force focus to a specific view, call requestFocus().
zh_cn: 要强制让一个特定的 view 获取焦点，调用 requestFocus() 方法。

source: To generate the content URI, create a new File for the file, then pass the File to getUriForFile().
zh_cn: 要生成 content URI，请为该文件创建一个新 File ，然后将 File 传递给 getUriForFile()。

source: To get a content URI for the file default_image.jpg in the images/ subdirectory of your internal storage add the following code:
zh_cn: 要在内部存储器的 images/ 子目录中获取文件 default_image.jpg 的 content URI，请添加以下代码：

source: To get a particular view to take focus, call requestFocus().
zh_cn: 要让一个特定的 view 来获取焦点，可以调用 requestFocus() 方法。

source: To get better results dithering should be applied.
zh_cn: 为了得到更好的结果，应该应用 dithering。

source: To get started with the MaterialToolbar component, use com.google.android.material.appbar.MaterialToolbar in your layout XML instead of androidx.appcompat.widget.Toolbar or Toolbar.
zh_cn: 要开始使用 MaterialToolbar 组件，请在布局 XML 中使用 com.google.android.material.appbar.MaterialToolbar 而不是 androidx.appcompat.widget.Toolbar 或 Toolbar。

source: To give an idea of the control you get with custom views, here are some examples of what you could do with them:
zh_cn: 给控制你自定义 VIew 的一些意见，这里是一些你可做的例子：

source: To grant an access permission to a content URI returned from getUriForFile(), do one of the following:
zh_cn: 要为从 getUriForFile() 返回的 content URI 授予访问权限，请执行以下操作之一：

source: To help with performance, the container includes an optimization when removing keys: instead of compacting its array immediately, it leaves the removed entry marked as deleted.
zh_cn: 为了提高性能，容器在移除键时包含一个优化：它不会立即压缩其数组，而是将移除的项标记为已移除。

source: To help you avoid missing constraints, the Layout Editor can automatically add constraints for you with the Autoconnect and infer constraints features.
zh_cn: 为了帮助我们去避免出现缺少约束的错误，布局编辑器的 Autoconnect and infer constraints 功能可以为你自动添加约束。

source: To implement a custom view, you will usually begin by providing overrides for some of the standard methods that the framework calls on all views.
zh_cn: 要实现一个自定义 view，你通常要先提供框架对所有 view 调用的标准方法。

source: To include only the parts of the library that your app needs, you can edit the library's files if the license allows you to modify the library.
zh_cn: 要仅包含应用程序所需库的部分，如果许可证允许你修改库，则你可以编辑库的文件。

source: To indicate determinate progress, you set the style of the progress bar to R.style.Widget_ProgressBar_Horizontal and set the amount of progress.
zh_cn: 要指示确定的进度，请将进度条的样式设置为 R.style.Widget_ProgressBar_Horizontal 并设置进度。

source: To indicate the different button states (focused, selected, etc.), you can define a different image for each state.
zh_cn: 要指示不同的按钮状态(聚焦，选择等)，你可以为每个状态定义不同的图像。

source: To initiate a layout, call requestLayout().
zh_cn: 要启动布局，请调用 requestLayout()。

source: To learn about inline tracing, see the documentation for the Trace functions, and for the Systrace tool.
zh_cn: 要了解内联跟踪，请参阅 Trace 函数和 Systrace 工具的文档。

source: To learn how to populate a list view with a CursorAdapter, see the discussion of filling an adapter view with text in the Layouts guide.
zh_cn: 要了解如何使用 CursorAdapter 填充列表 view，请参阅在 Layouts 指南中使用文本填充适配器 view 的讨论。

source: To learn more about Drawables, see: Drawable Resources.
zh_cn: 要了解有关 Drawables 的更多信息，请参阅：Drawable Resources。

source: To learn more about FileProvider, see the Android training class Sharing Files Securely with URIs.
zh_cn: 要了解有关 FileProvider 的更多信息，请参阅 Android 培训课程 Sharing Files Securely with URIs 。

source: To learn more about WebView and alternatives for serving web content, read the documentation on Web-based content.
zh_cn: 要了解有关 WebView 和 Web 服务内容替代方案的更多信息，请阅读 Web-based content 的文档。

source: To learn more about material design patterns for handling scrolling, see Scrolling techniques.
zh_cn: 要了解有关处理滚动的材质设计模式的更多信息，请参阅 Scrolling techniques。

source: To learn more about web browsers, read the guide on invoking a browser with an intent.
zh_cn: 要了解有关 Web 浏览器的更多信息，请阅读 invoking a browser with an intent 的指南。

source: To learn more about working with Bitmaps, see: Handling Bitmaps.
zh_cn: 要了解有关使用位图的更多信息，请参阅：Handling Bitmaps。

source: To link this file to the FileProvider, add a <meta-data> element as a child of the <provider> element that defines the FileProvider.
zh_cn: 要将此文件链接到 FileProvider，请将 <meta-data> 元素添加为定义 FileProvider 的 <provider> 元素的子元素。

source: To make a column stretch, make sure all of the components inside it define a weight or a gravity.
zh_cn: 要使列伸展，请确保其中的所有组件都定义了权重或重力。

source: To measure its dimensions, a view takes into account its padding.
zh_cn: 为了计算尺寸，view 考虑了它的 padding。

source: To minimize Dalvik heap allocations use the inBitmap flag instead.
zh_cn: 为了尽量减少 Dalvik 堆分配，请改用 inBitmap 标志。

source: To optimize your app for fast startup, it’s useful to understand what’s happening at the system and app levels, and how they interact, in each of these states.
zh_cn: 为了优化你的应用程序以实现快速启动，了解系统和应用程序级别发生的情况以及它们在每种状态下的交互方式非常有用。

source: To prevent a column from stretching, ensure that one of the components in the column does not define a weight or a gravity.
zh_cn: 要防止列拉伸，请确保列中的某个组件未定义权重或重力。

source: To prevent this, you can use the cruncherEnabled flag in Gradle to disable this process for PNG files:
zh_cn: 为防止这种情况，你可以使用 Gradle 中的 cruncherEnabled 标志为 PNG 文件禁用此过程：

source: To provide dynamic behavior, expose a property getter and setter pair for each custom attribute.
zh_cn: 要提供动态行为，请为每个自定义属性公开属性 getter 和 setter 方法。

source: To provide user-editable text, see EditText.
zh_cn: 要提供用户可编辑的文本，请参阅 EditText。

source: To receive calls to this method the ViewParent must have previously returned true for a call to onStartNestedScroll(View, View, int).
zh_cn: 要接收对此方法的调用，ViewParent 必须在先前 onStartNestedScroll(View, View, int) 的调用中返回 true。

source: To remove a constraint, select the view and then click the constraint handle.
zh_cn: 要删除约束，选择一个 view 然后点击约束控制点。

source: To remove the standard button background image, define your own background image or set the background color to be transparent.
zh_cn: 要移除标准按钮背景图像，请定义自己的背景图像或将背景颜色设置为透明。

source: To see a variety of layouts you can create with ConstraintLayout, check out the Constraint Layout Examples project on GitHub.
zh_cn: 要查看使用 ConstraintLayout 创建的各种布局，请查看 GitHub 上的 ConstraintLayout 项目： Constraint Layout Examples project on GitHub。

source: To share a file with another app using a content URI, your app has to generate the content URI.
zh_cn: 要使用 content URI 与另一个应用程序共享文件，你的应用程序必须生成 content URI。

source: To specify a directory, specify the its storage area and path in XML, using child elements of the <paths> element.
zh_cn: 要指定目录，指定其存储区域和 XML 路径，请使用 <paths> 元素的子元素。

source: To specify an action when a user clicks or taps on a single list item, see Handling click events.
zh_cn: 要在用户单击或点击单个列表项时指定操作，请参阅 Handling click events。

source: To specify an action when the button is pressed, set a click listener on the button object in the corresponding activity code:
zh_cn: 要在按下按钮时指定操作，请在相应 activity 代码中的按钮对象上设置单击监听器：

source: To specify the FileProvider component itself, add a <provider> element to your app manifest.
zh_cn: 要指定 FileProvider 组件本身，请在你的应用清单中添加一个 <provider> 元素。

source: To speed up your view, eliminate unnecessary code from routines that are called frequently.
zh_cn: 要加快 view 速度，请从频繁调用的例程中删除不必要的代码。

source: To start a fling, call fling() with the starting velocity and the minimum and maximum x and y values of the fling.
zh_cn: 要开始投掷，请使用起始速度以及投掷的最小和最大 x 和 y 值调用 fling()。

source: To start a new constraint layout file, follow these steps:
zh_cn: 要创建新的约束布局文件，请按照下列步骤：

source: To start its animation, call AnimatedImageDrawable.start():
zh_cn: 要开始动画，请调用 AnimatedImageDrawable.start()：

source: To start with, the platform includes a variety of prebuilt View and ViewGroup subclasses — called widgets and layouts, respectively — that you can use to construct your UI.
zh_cn: 初始时，安卓平台包含了各种预制的 View 和 ViewGroup 的子类，分别叫做 widgets 和 layouts，你可以用它们来创建自己的 UI。

source: To summarize, the use of a Layout as the basis for a Custom Control has a number of advantages, including:
zh_cn: 总之，使用 Layout 作为自定义控件的基类有一些优点，包括：

source: To support users with disabilities, you should:
zh_cn: 为了支持残障用户，你应该：

source: To take advantage of this feature, check if the convertView provided to getView(...) is null before creating or inflating a new view object.
zh_cn: 要利用此功能，请在创建或加载新 view 对象之前，检查提供给 getView(...) 的 convertView 是否为 null。

source: To track the changing positions of the x/y coordinates, use computeScrollOffset().
zh_cn: 要跟踪 x/y 坐标的变化位置，请使用 computeScrollOffset()。

source: To use ConstraintLayout in your project, proceed as follows:
zh_cn: 要在项目中使用 ConstraintLayout，按下列步骤进行：

source: To use shrinkResources, you must enable code shrinking.
zh_cn: 要使用 shrinkResources，必须启用代码缩减（shrinking）。

source: To use a DrawerLayout, position your primary content view as the first child with width and height of match_parent and no layout_gravity>.
zh_cn: 要使用 DrawerLayout，请将主要内容 view 定位为宽度和高度为 match_parent 且不包含 layout_gravity> 的第一个子 view。

source: To use a resource, you must install it correctly in the source tree (inside your project's res/ directory) and build your application.
zh_cn: 要使用资源，必须在源代码树中(在项目的 res/ 目录中)正确安装它并构建应用程序。

source: To use an XML menu resource, use inflateMenu(int).
zh_cn: 要使用 XML 菜单资源，请使用 inflateMenu(int)。

source: To use it, first create a Source using one of the createSource overloads.
zh_cn: 要使用它，首先使用 createSource 重载之一创建 Source。

source: To use the animation system, whenever a property changes that will affect your view's appearance, do not change the property directly.
zh_cn: 要使用动画系统，只要属性发生更改会影响 view 的外观，请不要直接更改属性。

source: To use the custom attributes from this class, you would use the tag com.example.customviews.charting.PieChart$PieView.
zh_cn: 要使用此类中的自定义属性，可以使用标记 com.example.customviews.charting.PieChart$PieView。

source: Toggles the INVERSE state of the filltype
zh_cn: 切换 filltype 的 INVERSE 状态

source: Toolbar supports a more focused feature set than ActionBar.
zh_cn: 工具栏支持比 ActionBar 更集中的功能集。

source: Touch events by themselves are not particularly useful.
zh_cn: 触摸事件本身并不是特别有用。

source: Transform the points in this path by matrix, and write the answer into dst.
zh_cn: 通过矩阵转换此路径中的点，并将答案写入 dst。

source: Transform the points in this path by matrix.
zh_cn: 通过矩阵转换此路径中的点。

source: Transportation object for returning WebView across thread boundaries.
zh_cn: 用于跨线程边界返回 WebView 的传输对象。

source: Traverses the ancestors of the given view and returns the item view that contains it and also a direct child of the LayoutManager.
zh_cn: 遍历给定 view 的所有祖先 view，并返回包含该 view 且为 LayoutManager 的直接子 view 的 item view。

source: Traverses the ancestors of the given view and returns the item view that contains it and also a direct child of the RecyclerView.
zh_cn: 遍历给定 view 的祖先 view，返回包含该 view 且是 RecyclerView 的直接子 view 的 item。

source: Treat Acronyms as Words
zh_cn: 将首字母缩写词视为字词

source: Treat acronyms and abbreviations as words in naming variables, methods, and classes to make names more readable:
zh_cn: 在为变量、方法和类命名时，请将首字母缩写词和缩写形式视为字词，使名称更具可读性：

source: True if results of getSpanIndex(int, int) are cached.
zh_cn: 如果 getSpanIndex(int, int) 的结果是缓存的，则返回 true。

source: True if the View should be recycled, false otherwise.
zh_cn: 如果 View 应被回收，则为 true；否则为 false。

source: True if the ViewHolder should not be removed from scrap/cache/
zh_cn: 如果不应从废料/缓存中移除 ViewHolder，则为 True/

source: True if the event was handled by the view, false otherwise.
zh_cn: 如果事件由 view 处理，则为 true；否则为 false。

source: True if the event was handled, false otherwise.
zh_cn: 如果事件被处理则为 True，否则为 false。

source: True to dispatch View recycled callbacks.
zh_cn: 如果要分发 view 回收回调则为 true。

source: Try first for an exact, non-invalid match from scrap.
zh_cn: 首先尝试从废料中获得精确的、非无效的匹配。

source: Try to avoid this.
zh_cn: 请尽量避免这种情况。

source: Trying to combine them will result in decodeDrawable/ decodeBitmap throwing an IllegalStateException.
zh_cn: 尝试将它们组合将导致 decodeDrawable / decodeBitmap 抛出 IllegalStateException。

source: Two steps you can take to address this issue are:
zh_cn: 你可以采取以下两个步骤来解决此问题：

source: Two useful techniques are removing debug symbols and not extracting native libraries.
zh_cn: 两种有用的技术是移除调试符号和避免提取 native 库。

source: Type codes need not be contiguous.
zh_cn: 类型代码不必是连续的。

source: Type mismatch.
zh_cn: 类型不匹配。

source: Typeface (normal, sans, serif, monospace) for the text.
zh_cn: 文本的字体(普通，无衬线，衬线，等宽字体)。

source: Typically contains the buttons like "Play/Pause", "Rewind", "Fast Forward" and a progress slider.
zh_cn: 通常包含“播放/暂停”，“倒带”，“快进”和进度滑块等按钮。

source: Typically used on optional parameters.
zh_cn: 通常用于可选参数。

source: Typically used with a parameter or return value of type array or collection.
zh_cn: 通常用于数组或集合类型的参数或返回值。

source: Typically, the onCreate() method has the greatest impact on load time, because it performs the work with the highest overhead: loading and inflating views, and initializing the objects needed for the activity to run.
zh_cn: 通常，onCreate() 方法对加载时间的影响最大，因为它以最高的开销执行工作：加载和填充视图，以及为要运行的 activity 初始化所需的对象。

source: UI designers sometimes create deep hierarchies of nested ViewGroup objects in order to get the UI to behave properly.
zh_cn: UI 设计人员有时会创建嵌套的 ViewGroup 对象的深层次结构，以使 UI 正常运行。

source: UI elements fade in and out instead of appearing and disappearing.
zh_cn: UI 元素淡入淡出而不是出现和消失。

source: UNSPECIFIED: This is used by a parent to determine the desired dimension of a child view.
zh_cn: UNSPECIFIED：用于父 view 确定子 view 所需的尺寸。

source: Unchecked exception thrown to indicate a syntax error in a regular-expression pattern.
zh_cn: 抛出未检查的异常，表示正则表达式中的语法错误。

source: Understand app-start internals
zh_cn: 了解 app 启动时的内部过程

source: Understand the APK structure
zh_cn: 了解 APK 结构

source: Unfortunately, a malicious application could try to spoof the user into performing these actions, unaware, by concealing the intended purpose of the view.
zh_cn: 不幸的是，一些恶意的应用会尝试隐藏 view 的意图，让用户未察觉地哄骗用户执行这些操作。

source: Union (inclusive-or) the two paths.
zh_cn: 并集，合并 (inclusive-or) 两条路径。

source: Unless otherwise noted, passing a null argument to a method in any class or interface in this package will cause a NullPointerException to be thrown.
zh_cn: 除非另行说明，将 null 参数传递给此包中任意类或接口中的方法将导致抛出 NullPointerException 。

source: Unless the ConstraintLayout happens to have the exact same size as the Button, both constraints cannot be satisfied at the same time (both sides cannot be where we want them to be).
zh_cn: 除非 ConstraintLayout 具有与 Button 完全相同的大小，否则两个约束都不能同时满足(双方都不能在我们想要的地方)。

source: Unlike #performClick(), this only calls the listener, and does not do any associated clicking actions like reporting an accessibility event.
zh_cn: 与 #performClick() 不同，它只调用监听器，不执行任何相关的点击操作，如报告无障碍事件。

source: Unlike SurfaceView, TextureView does not create a separate window but behaves as a regular View.
zh_cn: 与 SurfaceView 不同，TextureView 不会创建单独的窗口，而是表现为常规 view。

source: Unlike IDs, tags are not used to identify views.
zh_cn: 不像 IDs，tags 不用来标识 view。

source: Unlike ListView adapters, types need not be contiguous.
zh_cn: 与 ListView 适配器不同，类型不需要是连续的。

source: Unlike a normal array of Objects, there can be gaps in the indices.
zh_cn: 与正常的对象数组不同，索引中可能存在间隙。

source: Unlike dividing the original width and height by the sampleSize manually, calling this method allows ImageDecoder to round in the direction that it can do most efficiently.
zh_cn: 与手动将 sampleSize 除以原始宽度和高度不同，调用此方法允许 ImageDecoder 在最有效的方向上进行舍入。

source: Unlike the built-in views, your custom view can make application-specific assumptions about the size and shape of its children, and thus avoid traversing its children to calculate measurements.
zh_cn: 与内置 view 不同，你的自定义 view 可以针对其子项的大小和形状进行特定于应用程序的假设，从而避免遍历其子项以计算度量。

source: Unlike the window flag, if you are using ActionBar in overlay mode with Window.FEATURE_ACTION_BAR_OVERLAY, then enabling this flag will also hide the action bar.
zh_cn: 与窗口标志不同，如果在 overlay 模式下使用 ActionBar 并使用 Window.FEATURE_ACTION_BAR_OVERLAY，则启用此标志也会隐藏操作栏。

source: Unregister an observer currently listening for data changes.
zh_cn: 注销当前正在侦听数据更改的观察者。

source: Update list of touch targets for pointer down, if needed.
zh_cn: 如果需要，更新指针 down 的触摸目标列表。

source: Update list of touch targets for pointer up or cancel, if needed.
zh_cn: 更新指针 up 或 cancel 的触摸目标列表(如果需要)。

source: Upon a scroll ending, if the view is only partially visible then it will be snapped and scrolled to its closest edge.
zh_cn: 在滚动结束时，如果 view 仅部分可见，则它将被捕捉并滚动到其最近的边缘。

source: Upon receiving this callback, Adapter can clear the animation(s) that effect the View's transient state and return true so that the View can be recycled.
zh_cn: 在接收到这个回调之后，适配器可以清除影响 View 瞬态的动画，并返回 true，以便可以回收 View。

source: Usage with BitmapFactory
zh_cn: 与 BitmapFactory 一起使用

source: Usage with BitmapRegionDecoder
zh_cn: 与 BitmapRegionDecoder 一起使用

source: Use "horizontal" for a row, "vertical" for a column.
zh_cn: 对于行使用“horizo​​ntal”，对于列使用“vertical”。

source: Use TabLayout and ViewPager instead.
zh_cn: 请改用 TabLayout and ViewPager。

source: Use ViewHolder#isBound() on the returned object to check for this.
zh_cn: 对返回的对象使用 ViewHolder#isBound() 来检查这一点。

source: Use FrameLayout, RelativeLayout or a custom layout instead.
zh_cn: 请改用 FrameLayout，RelativeLayout 或自定义布局。

source: Use SYSTEM_UI_FLAG_LOW_PROFILE instead.
zh_cn: 请改用 SYSTEM_UI_FLAG_LOW_PROFILE。

source: Use SYSTEM_UI_FLAG_VISIBLE instead.
zh_cn: 请改用 SYSTEM_UI_FLAG_VISIBLE。

source: Use getItemOffsets(Rect, View, RecyclerView, State)
zh_cn: 使 getItemOffsets(Rect, View, RecyclerView, State)

source: Use setChildIndicator(android.graphics.drawable.Drawable) or setGroupIndicator(android.graphics.drawable.Drawable) (or the corresponding XML attributes) to set these indicators (see the docs for each method to see additional state that each Drawable can have).
zh_cn: 使用 setChildIndicator(android.graphics.drawable.Drawable) 或 setGroupIndicator(android.graphics.drawable.Drawable) (或相应的 XML 属性)来设置这些指标(请参阅每个方法的文档以查看每个 Drawable 可以具有的其他状态)。

source: Use import foo.Bar; for importing all Android code.
zh_cn: 使用 import foo.Bar; 导入所有 Android 代码。

source: Use setAudioFocusRequest(int) to change this behavior.
zh_cn: 使用 setAudioFocusRequest(int) 更改此行为。

source: Use Javadoc Standard Comments
zh_cn: 使用 Javadoc 标准备注

source: Use Spaces for Indentation
zh_cn: 使用空格缩进

source: Use Standard Brace Style
zh_cn: 使用标准大括号样式

source: Use Standard Java Annotations
zh_cn: 使用标准 Java 注释

source: Use TODO Comments
zh_cn: 使用 TODO 备注

source: Use TODO comments for code that is temporary, a short-term solution, or good-enough but not perfect.
zh_cn: 为代码使用 TODO 备注是短期的临时解决方案，或者说足够好但并不完美。

source: Use WebP file format
zh_cn: 使用 WebP 文件格式

source: Use a Runnable and post this rather than calling performClick directly.
zh_cn: 使用 Runnable 并 post 它，而不是直接调用 performClick。

source: Use a custom view or layout to handle this functionality instead
zh_cn: 使用自定义 view 或布局来代替处理此功能

source: Use a software allocation for the pixel memory.
zh_cn: 为像素内存使用软件分配。

source: Use determinate mode for the progress bar when you want to show that a specific quantity of progress has occurred.
zh_cn: 如果要显示已发生特定数量的进度，请使用进度条的确定模式。

source: Use drawable objects
zh_cn: 使用 drawable 对象

source: Use indeterminate mode for the progress bar when you do not know how long an operation will take.
zh_cn: 当你不知道操作需要多长时间时，请对进度条使用不确定模式。

source: Use inline tracing to investigate likely culprits including:
zh_cn: 使用内联跟踪来调查可能的罪魁祸首，包括：

source: Use logo instead of icon if available.
zh_cn: 如果可用，使用 logo 而不是图标。

source: Use other means to handle this functionality.
zh_cn: 使用其他方法来处理此功能。

source: Use shared memory for the pixel memory.
zh_cn: 为像素内存使用共享内存。

source: Use the arm-eabi-strip tool, provided in the Android NDK, to remove unnecessary debug symbols from native libraries.
zh_cn: 使用 Android NDK 中提供的 arm-eabi-strip 工具从 native 库中移除不必要的调试符号。

source: Use the Custom Component
zh_cn: 使用自定义的组件

source: Use the default allocation for the pixel memory.
zh_cn: 为像素内存使用默认分配。

source: Use the most natural Bitmap.Config for the internal Bitmap.
zh_cn: 使用最自然的 Bitmap.Config 作为内部 Bitmap。

source: Use the value returned by getFormat12Hour() when non-null
zh_cn: 当非空时，使用 getFormat12Hour() 返回的值

source: Use the value returned by getFormat24Hour() when non-null
zh_cn: 当非空时，使用 getFormat24Hour() 返回的值

source: Use this flag to create an immersive experience while also hiding the system bars.
zh_cn: 使用此标志可以创建身临其境的体验，同时还可以隐藏系统栏。

source: Use to set the matchConstraintDefaultWidth and matchConstraintDefaultHeight
zh_cn: 用于设置 matchConstraintDefaultWidth 和 matchConstraintDefaultHeight

source: Use vector graphics
zh_cn: 使用矢量图形

source: Use vector graphics for animated images
zh_cn: 将矢量图形用于动画图像

source: Use with focusSearch(int).
zh_cn: 与 focusSearch(int) 一起使用。

source: Use with setVisibility(int, int) and android:visibility.
zh_cn: 配合 setVisibility(int, int) 各 android:visibility 使用。

source: Use your new extension class.
zh_cn: 使用你新的继承类。

source: Used as a fast path for unscrapping and recycling a view during a bulk operation.
zh_cn: 用作在批量操作期间取消废弃和回收 view 的快速路径。

source: Used at design time for a horizontally unconstrained child.
zh_cn: 在设计时用于水平无约束的孩子。

source: Used at design time for a vertically unconstrained child.
zh_cn: 在设计时用于竖直无约束的孩子。

source: Used by ListView and GridView to stack their content from the bottom.
zh_cn: 由 ListView 和 GridView 用于从底部堆叠其内容。

source: Used for being notified when a group is collapsed
zh_cn: 用于在组折叠时收到通知

source: Used for being notified when a group is expanded
zh_cn: 用于在组展开时收到通知

source: Used to create a horizontal create guidelines.
zh_cn: 用于创建垂直的 guideline。

source: Used to create a vertical create guidelines.
zh_cn: 用于创建垂直方向的 guideline。

source: Used to indicate a parameter is cleared or not set
zh_cn: 用于指明参数被清除或未设置

source: Used to mark a View that has no ID.
zh_cn: 用于标记没有 ID 的 view。

source: Used to write apps that run on platforms prior to Android 3.0.
zh_cn: 用于编写运行在 Android 3.0 以前的平台的 app。

source: Useful for drawing to a software Canvas or for accessing the pixels on the final output.
zh_cn: 用于绘制软件 Canvas 或用于访问最终输出上的像素。

source: Useful for sharing across processes.
zh_cn: 对于跨进程共享很有用。

source: User actions are turned into events that trigger callbacks, and you can override the callbacks to customize how your application responds to the user.
zh_cn: 用户操作将转换为触发回调的事件，你可以重写回调以自定义应用程序响应用户的方式。

source: User interface state that is stored by NavigationView for implementing onSaveInstanceState().
zh_cn: 用户界面状态，由 NavigationView 存储以实现 onSaveInstanceState()。

source: Users also sense subtle behavior or feel in an interface, and react best to subtleties that mimic the real world.
zh_cn: 用户还可以在界面中感受微妙的行为或感觉，并对模仿现实世界的细微之处做出最佳反应。

source: Users expect a modern UI to transition smoothly between states.
zh_cn: 用户期望现代 UI 在各状态之间平滑过渡。

source: Users expect apps to be responsive and fast to load.
zh_cn: 用户希望应用程序能够快速响应并快速加载。
